{
  "term": "Fall",
  "year": "2001",
  "level": [
    "Graduate"
  ],
  "topics": [
    [
      "Engineering",
      "Computer Science",
      "Artificial Intelligence"
    ],
    [
      "Science",
      "Cognitive Science"
    ],
    [
      "Engineering",
      "Computer Science",
      "Theory of Computation"
    ]
  ],
  "legacy_uid": "51ed8fd9-de9d-da8b-1982-3adaf485a9c1",
  "instructors": {
    "content": [
      "c91ce378-adf8-ef81-4750-22d198f289c2"
    ],
    "website": "ocw-www"
  },
  "course_image": {
    "content": "b626878b-f85d-cb8e-b509-6231dd1c9add",
    "website": "mas-963-out-of-context-a-course-on-computer-systems-that-adapt-to-and-learn-from-context-fall-2001"
  },
  "course_title": "Out of Context: A Course on Computer Systems That Adapt To, and Learn From, Context",
  "hide_download": true,
  "course_description": "Increasingly, we are realizing that to make computer systems more intelligent and responsive to users, we will have to make them more sensitive to context. Traditional hardware and software design overlooks context because it conceptualizes systems as input-output functions. Systems take input explicitly given to them by a human, act upon that input alone and produce explicit output. But this view is too restrictive. Smart computers, intelligent agent software, and digital devices of the future will also have to operate on data that they observe or gather for themselves. They may have to sense their environment, decide which aspects of a situation are really important, and infer the user's intention from concrete actions. The system's actions may be dependent on time, place, or the history of interaction, in other words, dependent upon context.\n\nBut what exactly is context? We'll look at perspectives from machine learning, sensors and embedded devices, information visualization, philosophy and psychology. We'll see how each treats the problem of context, and discuss the implications for design of context-sensitive hardware and software.\n\nCourse requirements will consist of critiques of class readings (about 3 papers/week), and a final project (paper or computer implementation project).\n",
  "department_numbers": [
    "MAS"
  ],
  "extra_course_numbers": "",
  "primary_course_number": "MAS.963",
  "course_image_thumbnail": {
    "content": "31e3562f-9264-eeb6-4b7f-dbdf7b7dce31",
    "website": "mas-963-out-of-context-a-course-on-computer-systems-that-adapt-to-and-learn-from-context-fall-2001"
  },
  "hide_download_original": null,
  "learning_resource_types": [
    "Lecture Notes",
    "Projects with Examples"
  ],
  "site_uid": "eac26e76-16c3-4f2a-8216-0b84f559cb6a",
  "site_short_id": "mas.963-fall-2001",
  "site_url_path": "courses/mas-963-out-of-context-a-course-on-computer-systems-that-adapt-to-and-learn-from-context-fall-2001",
  "title": "Course Metadata"
}